app/views/flights/index.html.erb

SELECT "airports".* FROM "airports" ORDER BY "airports"."code" ASC
---
    Departure Airports:
<%= form.collection_select :departure_id, Airport.order(:code), :id, :code, include_blank: true %>

SELECT "flights".* FROM "flights" ORDER BY "flights"."arrival_time" ASC
---
    flight arrivals
<%= form.collection_select :flight_id, Flight.order(:arrival_time), :id, :arrival_day  %>