flight-booker-backend/app/controllers/bookings_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    if params.key?(:flight_id)
      @booking = Booking.new
      @flight = Flight.find(params[:flight_id])

INSERT INTO "bookings" ("passenger_id", "flight_id", "status", "name", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["passenger_id", nil], ["flight_id", 2], ["status", nil], ["name", nil], ["email", nil]]
SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "passengers" ("name", "age", "email", "booking_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "bob"], ["age", "25"], ["email", "bob@bob.com"], ["booking_id", 1], ["user_id", nil]]
---
  def create
    booking_params = valid_booking_params(params)
    @booking = Booking.new(booking_params)
    if @booking.save!
      if(params[:booking][:discount] == "yes")
        @promo_code = PromoCode.new(:booking_id => @booking.id)
        @promo_code.save!
      end
      redirect_to @booking
      @flight = Flight.find(params[:booking][:flight_id])
      @emails = []
      params[:booking][:passengers_attributes].each { |_key, value| @emails.push(value[:email]) }