app/controllers/flights_controller.rb

  def flight_search
    found_flight = Flight.find_flight(params)
---
SELECT "flights".* FROM "flights" WHERE (id = '2') ORDER BY "flights"."id" ASC LIMIT $1  [["LIMIT", 1]]